[
  {
    "id": "1",
    "title": "Baldur's Gate 3",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1086940/48a2fcbda8565bb45025e98fd8ebde8a7203f6a0/header.jpg?t=1748346026",
    "category": "RPG",
    "downloadLink": "https://store.steampowered.com/app/1086940/Baldurs_Gate_3/",
    "description": "Baldur's Gate 3 is an epic role-playing game that brings the rich world of Dungeons & Dragons to life with stunning visuals and deep narrative choices. Create your custom character or choose from origin characters with their own unique stories, then embark on a thrilling adventure across the Forgotten Realms. The game features turn-based tactical combat that faithfully recreates D&D 5th Edition rules, allowing for creative problem-solving and strategic battles. Every decision you make influences your relationships with companions, shapes the world around you, and determines the fate of entire civilizations. With branching storylines, romance options, and countless ways to approach challenges through combat, diplomacy, or stealth, no two playthroughs are alike. The game supports both single-player and cooperative multiplayer modes, letting you share your adventure with friends.",
    "ratings": "4.9",
    "developer": "Larian Studios",
    "downloads": 18000000,
    "totalReviews": 806388
  },
  {
    "id": "2",
    "title": "Palworld",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2771110/ss_3ea195bfd10dfeb0e27a0419b8bcf95e9564d3a2.1920x1080.jpg?t=1705651206",
    "category": "Survival",
    "downloadLink": "https://store.steampowered.com/app/1623730/Palworld/",
    "description": "Palworld is an innovative multiplayer survival crafting game that combines creature collection with base building and exploration in a vast open world. Players catch and befriend mysterious creatures called Pals, each with unique abilities that can be utilized for various tasks including combat, farming, construction, and manufacturing. Build expansive bases with automated production lines powered by your Pals, explore dangerous dungeons filled with rare resources and powerful bosses, and engage in intense battles against poachers and wildlife. The game features both peaceful farming simulation elements and intense survival mechanics where you must manage hunger, temperature, and stamina. Play solo or team up with friends in online cooperative multiplayer to build thriving civilizations. With its unique blend of creature collecting, factory automation, and survival gameplay, Palworld offers hundreds of hours of engaging content as you discover new Pals, unlock advanced technologies, and conquer the wilderness.",
    "ratings": "4.3",
    "developer": "Pocketpair",
    "downloads": 18000000,
    "totalReviews": 381775
  },
  {
    "id": "3",
    "title": "Elden Ring",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1245620/header.jpg?t=1748630546",
    "category": "Action RPG",
    "downloadLink": "https://store.steampowered.com/app/1245620/ELDEN_RING/",
    "description": "Elden Ring is a groundbreaking action RPG created by FromSoftware in collaboration with renowned fantasy author George R.R. Martin, who crafted the game's mythology and lore. Set in the vast and mysterious Lands Between, players assume the role of a Tarnished warrior seeking to restore the shattered Elden Ring and become the Elden Lord. The game features an enormous open world filled with diverse landscapes including sprawling plains, treacherous swamps, majestic castles, and underground cities, all connected seamlessly for exploration on foot or horseback. Combat is challenging and rewarding, requiring precise timing, strategic positioning, and mastery of various weapons, magic spells, and special abilities. Face off against memorable bosses, each with unique attack patterns and epic designs. The game offers tremendous build variety with dozens of weapon types, sorceries, incantations, and customizable summons. With its rich storytelling, atmospheric world design, and unforgiving yet fair difficulty, Elden Ring delivers an unforgettable adventure that has captivated millions of players worldwide.",
    "ratings": "4.7",
    "developer": "FromSoftware",
    "downloads": 19000000,
    "totalReviews": 1097287
  },
  {
    "id": "4",
    "title": "Helldivers 2",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/553850/68153c9e42e78199266ac9fcefa9104065f39c07/capsule_616x353.jpg?t=1757033568",
    "category": "Shooter",
    "downloadLink": "https://store.steampowered.com/app/553850/HELLDIVERS_2/",
    "description": "Helldivers 2 is an intense cooperative third-person shooter that drops you into the boots of elite soldiers fighting to spread managed democracy across a hostile galaxy. Team up with up to three friends to complete dangerous missions on alien worlds, battling swarms of giant insects and rogue automaton forces. The game features a unique friendly fire system that keeps combat tense and communication crucial, as one wrong shot can take down your entire squad. Call in devastating stratagems including orbital strikes, supply drops, defensive turrets, and powerful vehicles to turn the tide of battle. Each mission is procedurally generated with dynamic objectives, ensuring fresh challenges every time you deploy. Coordinate loadouts with your team, choosing from a vast arsenal of primary weapons, support weapons, armor types, and tactical equipment. Progress through the ongoing galactic war by liberating planets and sectors, with the entire player community working together to achieve major objectives. With its emphasis on teamwork, chaotic combat scenarios, and satisfying gunplay, Helldivers 2 delivers endless hours of explosive cooperative action.",
    "ratings": "4.6",
    "developer": "Arrowhead Game Studios",
    "downloads": 16000000,
    "totalReviews": 1083942
  },
  {
    "id": "5",
    "title": "Counter-Strike 2",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/730/capsule_616x353.jpg?t=1749053861",
    "category": "FPS",
    "downloadLink": "https://store.steampowered.com/app/730/CounterStrike_2/",
    "description": "Counter-Strike 2 represents the next evolution of the legendary tactical FPS franchise, completely rebuilt on Valve's cutting-edge Source 2 engine. This competitive 5v5 shooter pits terrorists against counter-terrorists in objective-based matches where precision, teamwork, and strategy determine victory. Every weapon has realistic recoil patterns and precise hitboxes, rewarding players who invest time mastering the mechanics. The game features fully redesigned maps with dynamic smoke grenades that interact realistically with the environment, volumetric lighting that affects visibility, and responsive server-side game logic ensuring every player sees the same battlefield. Choose from classic maps like Dust II, Mirage, and Inferno, each meticulously updated with enhanced visuals while maintaining the competitive integrity players expect. The in-game economy system requires teams to manage their finances carefully, deciding when to save, force-buy, or full-buy equipment across rounds. Climb through competitive ranks from Silver to Global Elite, or enjoy casual modes including deathmatch, arms race, and community servers. With its thriving esports scene, active trading economy, and skill-based gameplay that rewards dedication, Counter-Strike 2 continues the franchise's legacy as one of gaming's most competitive experiences.",
    "ratings": "4.4",
    "developer": "Valve",
    "downloads": 250000000,
    "totalReviews": 9203285
  },
  {
    "id": "6",
    "title": "The Finals",
    "coverPhoto": "https://imageio.forbes.com/specials-images/imageserve/653d1491d815981e910e08d8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "category": "FPS",
    "downloadLink": "https://store.steampowered.com/app/2073850/THE_FINALS/",
    "description": "The Finals is an innovative free-to-play competitive shooter that reimagines combat with fully destructible environments set within a virtual combat game show. Compete in intense 3v3v3v3 cash-out matches where four teams simultaneously battle for dominance, with the primary objective being to steal cash vaults, defend them at designated cashout stations, and secure the funds before rivals can interfere. What sets The Finals apart is its revolutionary destruction system—every wall, floor, ceiling, and structure can be demolished, allowing players to create new pathways, collapse buildings on enemies, or completely reshape the battlefield mid-combat. Choose from three contestant classes: Light builds focused on mobility and stealth with grappling hooks and cloaking devices, Medium builds offering balanced offensive capabilities with healing abilities and versatile weapons, or Heavy builds equipped with massive health pools and devastating weapons like sledgehammers and rocket launchers. Each class has unique gadgets including deployable shields, ziplines, explosive barrels, jump pads, and more. The game features spectacular environmental hazards and interactive elements like gas canisters, cars that can be thrown, and structures that react realistically to damage. Coordinate with your team to execute creative strategies, whether that means breaching through unexpected angles, collapsing the floor beneath enemies, or fortifying cashout stations with defensive gadgets. With its dynamic gameplay, spectacular destruction physics, and game-show presentation complete with commentary and leaderboards, The Finals delivers a fresh and chaotic take on competitive shooters.",
    "ratings": "4.3",
    "developer": "Embark Studios",
    "downloads": 15000000,
    "totalReviews": 198025
  },
  {
    "id": "7",
    "title": "Valorant",
    "coverPhoto": "https://www.riotgames.com/darkroom/1440/d0807e131a84f2e42c7a303bda672789:3d02afa7e0bfb75f645d97467765b24c/valorant-offwhitelaunch-keyart.jpg",
    "category": "FPS",
    "downloadLink": "https://playvalorant.com/",
    "description": "Valorant is Riot Games' premier competitive tactical shooter that combines precise gunplay with unique character abilities, creating a deeply strategic 5v5 experience. Choose from a diverse roster of agents, each with distinctive abilities including smokes, flashes, walls, healing, and ultimate powers that can turn the tide of rounds. Attackers must plant the Spike bomb at designated sites while defenders work to prevent detonation or defuse it in time. Every match requires perfect aim, strategic ability usage, economic management, and seamless team coordination. The game runs on Riot's proprietary engine optimized for competitive play, featuring 128-tick servers, aggressive anti-cheat measures, and netcode designed to ensure every shot registers accurately. Master a variety of weapons from sidearms to rifles and snipers, each with distinct spray patterns and damage profiles. Climb the competitive ranked ladder from Iron to Radiant, or practice in unrated matches, deathmatch, and special game modes. Regular updates introduce new agents, maps, weapon skins, and seasonal battle passes that keep the meta fresh. With its thriving professional esports scene, regular tournaments, and emphasis on competitive integrity, Valorant has become one of the most popular tactical shooters in the world.",
    "ratings": "4.5",
    "developer": "Riot Games",
    "downloads": 100000000,
    "totalReviews": 2000000
  },
  {
    "id": "8",
    "title": "Starfield",
    "coverPhoto": "https://cdn.wccftech.com/wp-content/uploads/2025/10/Starfield-PS5-2026.jpg",
    "category": "RPG",
    "downloadLink": "https://store.steampowered.com/app/1716740/Starfield/",
    "description": "Starfield is Bethesda Game Studios' ambitious space exploration RPG that lets you journey across the stars in humanity's greatest adventure. Set in the year 2330, you play as a member of Constellation, the last group of space explorers seeking to uncover rare artifacts and unravel the mysteries of the universe. The game features over 1,000 planets across 100+ star systems, each with unique environments, flora, fauna, and resources to discover. Build and customize your own spacecraft, managing everything from weapons and shields to cargo capacity and crew quarters, then engage in thrilling space combat or peaceful exploration. On planetary surfaces, establish outposts, mine resources, research alien life, and uncover abandoned facilities filled with secrets. The robust character creation system lets you define your background, traits, and skills, shaping how you approach challenges through combat, persuasion, stealth, or technology. Join various factions including the United Colonies, Freestar Collective, Crimson Fleet pirates, or corporate entities, each offering unique questlines and philosophical perspectives. With hundreds of hours of content including main story missions, faction campaigns, side quests, base building, ship customization, and endless exploration, Starfield delivers the ultimate space RPG experience.",
    "ratings": "4.2",
    "developer": "Bethesda Game Studios",
    "downloads": 3700000,
    "totalReviews": 168770
  },
  {
    "id": "9",
    "title": "Marvel Rivals",
    "coverPhoto": "https://cdn2.unrealengine.com/01-1920x1080-1920x1080-88255a697e4f.jpg",
    "category": "Hero Shooter",
    "downloadLink": "https://www.marvelrivals.com/",
    "description": "Marvel Rivals is an action-packed free-to-play hero shooter that brings together iconic Marvel superheroes and villains in explosive 6v6 team battles. Choose from a growing roster of beloved characters including Spider-Man, Iron Man, Magneto, Storm, Hulk, and many more, each faithfully recreated with unique abilities, ultimate powers, and playstyles that reflect their comic book counterparts. The game features three distinct roles: Vanguard tanks who absorb damage and create space, Duelist damage dealers who eliminate enemies, and Strategist supports who heal and buff teammates. Team compositions matter significantly, with certain character combinations unlocking powerful team-up abilities that can change the course of battle. Fight across dynamic maps inspired by iconic Marvel locations, from the streets of Tokyo to the mystical realm of Asgard, each designed with multiple pathways and strategic positions. The destructible environments add tactical depth as heroes can smash through walls, create new sightlines, and alter the battlefield itself. Master intricate movement mechanics including web-slinging, flying, teleporting, and wall-running depending on your chosen hero. Progress through seasonal content, unlock cosmetic customization options, and compete in ranked modes where coordination and hero mastery determine victory. With its combination of superhero fantasy fulfillment and competitive shooter mechanics, Marvel Rivals offers thrilling gameplay for both Marvel fans and FPS enthusiasts.",
    "ratings": "4.4",
    "developer": "NetEase Games",
    "downloads": 20000000,
    "totalReviews": 347867
  },
  {
    "id": "10",
    "title": "Cyberpunk 2077",
    "coverPhoto": "https://cdn1.epicgames.com/offer/77f2b98e2cef40c8a7437518bf420e47/EGS_Cyberpunk2077UltimateEdition_CDPROJEKTRED_Editions_S1_2560x1440-b8bfbed19257188c717a26ee5bf79b41",
    "category": "RPG",
    "downloadLink": "https://store.steampowered.com/app/1091500/Cyberpunk_2077/",
    "description": "Cyberpunk 2077 is a narrative-driven open-world RPG set in the neon-drenched metropolis of Night City, where high-tech and low-life collide in a story of ambition, betrayal, and survival. Play as V, a customizable mercenary with a cybernetic implant that stores a bio-digital copy of a legendary rockstar's engram, racing against time to overwrite your mind before it consumes you. Explore a sprawling urban jungle teeming with gangs, corporations, fixers, and netrunners, each with their own agendas and quests that branch into multiple endings based on your choices. Customize your build with cyberware enhancements, quickhacks for hacking enemies and devices, and a vast arsenal of iconic weapons from katanas to smart guns. Engage in dynamic first- or third-person combat blending gunplay, melee, and stealth, with vehicles for high-speed chases across rain-slicked streets. Dive into deep character interactions, romance options, and side gigs that flesh out the world's lore inspired by the Cyberpunk tabletop RPG. Post-launch expansions like Phantom Liberty introduce new districts, spy-thriller storylines with Idris Elba's character, and vehicle combat. With its blend of immersive storytelling, player agency, and stunning visuals powered by REDengine, Cyberpunk 2077 offers a deeply personal journey through a future where humanity is just another commodity.",
    "ratings": "4.8",
    "developer": "CD Projekt RED",
    "downloads": 23000000,
    "totalReviews": 768482
  },
  {
    "id": "11",
    "title": "God of War Ragnarök",
    "coverPhoto": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2322010/capsule_616x353.jpg?t=1750909504",
    "category": "Action Adventure",
    "downloadLink": "https://store.steampowered.com/app/2322010/God_of_War_Ragnark/",
    "description": "God of War Ragnarök is an epic action-adventure sequel that continues Kratos and Atreus' saga in the Norse realms, confronting the prophesied end of the world with themes of fatherhood, fate, and redemption. Traverse the Nine Realms—from the frozen peaks of Midgard to the fiery depths of Muspelheim—using the Leviathan Axe for precise, elemental combat and the Blades of Chaos for devastating combos, alongside new weapons like the Draupnir Spear for versatile spear-throwing and runic attacks. The semi-open world encourages exploration with puzzles, secrets, and side quests that expand the lore, featuring revamped realms with verticality, fast travel ravens, and customizable gear upgrades. Engage in brutal, cinematic boss battles against gods like Thor and Odin, with adaptive combat systems that reward timing, resource management, and companion commands. Atreus grows as a playable character with archery and summoning abilities, while new allies like Angrboda and companions like Mimir provide narrative depth through heartfelt dialogues and moral dilemmas. The game supports accessibility options, New Game+ mode, and photo mode for capturing mythical moments. Fully voiced in multiple languages with a gripping orchestral score, God of War Ragnarök delivers emotional highs, visceral combat, and a world rich with myth that redefines the God of War legacy.",
    "ratings": "4.4",
    "developer": "Santa Monica Studio",
    "downloads": 1000000,
    "totalReviews": 38051
  },
  {
    "id": "12",
    "title": "Hogwarts Legacy",
    "coverPhoto": "https://cdn1.epicgames.com/offer/e97659b501af4e3981d5430dad170911/EGS_HogwartsLegacyDigitalDeluxeEdition_AvalancheSoftware_Editions_S1_2560x1440-8620ef5ee70cedeb3b2906945512d077",
    "category": "RPG",
    "downloadLink": "https://store.steampowered.com/app/990080/Hogwarts_Legacy/",
    "description": "Hogwarts Legacy is an immersive open-world action RPG that places you in the 1800s wizarding world of Harry Potter as a fifth-year student with a rare ability to trace ancient magic, unraveling a goblin rebellion that threatens the fragile peace between wizards and magical creatures. Attend Hogwarts School of Witchcraft and Wizardry, choosing from four houses—Gryffindor, Hufflepuff, Ravenclaw, or Slytherin—through the Sorting Hat ceremony, then customize your avatar with unique appearances, wands, and broom styles. Master over 30 spells like Accio for telekinesis, Incendio for fire, and Wingardium Leviosa for levitation, combining them in combat duels, puzzle-solving, and beast taming against trolls, spiders, and dark wizards. Explore a vast map including the Forbidden Forest, Hogsmeade village, and underground chambers filled with Merlin Trials, Demiguise statues, and Floo Flame fast travel points. Build relationships with professors like Eleazar Fig and peers like Sebastian Sallow through branching dialogue trees, romance-free storylines, and moral choices that affect alliances and endings. Craft potions for buffs, upgrade talents in a skill tree for stealth, room of requirement base building, or combat prowess, and ride mounts like Hippogriffs for aerial traversal. With its faithful recreation of J.K. Rowling's universe, stunning Unreal Engine 5 visuals, and hours of side content, Hogwarts Legacy fulfills the dream of living as a witch or wizard in a world of wonder and danger.",
    "ratings": "4.6",
    "developer": "Avalanche Software",
    "downloads": 11000000,
    "totalReviews": 313248
  },
  {
    "id": "13",
    "title": "Diablo IV",
    "coverPhoto": "https://developer.microsoft.com/content/dam/microsoftgamedev/blogs/images/header/2024/10/diablo4_HERO2.png",
    "category": "Action RPG",
    "downloadLink": "https://store.steampowered.com/app/2344520/Diablo_IV/",
    "description": "Diablo IV is a dark action RPG that returns to Sanctuary in a seamless open world plagued by Lilith, the Mother of Sanctuary, whose corrupting influence spawns demonic horrors and tests the limits of heroism. Choose from six classes—Barbarian for melee fury, Sorceress for elemental mastery, Rogue for agile precision, Druid for nature shapeshifting, Necromancer for undead legions, or Spiritborn for jungle mysticism—each with deep skill trees, legendary aspects, and paragon boards for endless build customization. Traverse five diverse regions from the arid deserts of Kehjistan to the shadowy depths of Hawezar, uncovering strongholds, world events, and helltides teeming with loot and elite foes. Engage in visceral isometric combat with satisfying click-to-kill mechanics, dodging infernal attacks while unleashing skills like Whirlwind spins or Meteor barrages, amplified by mounts for faster traversal and PvP zones for risky duels. The campaign weaves a grim narrative of faith, betrayal, and demonic pacts, with post-story endgame including seasonal realms, dungeon crawling, and the Tree of Whispers for bounty hunts. Cross-play and cross-progression unite platforms, while expansions like Vessel of Hatred introduce new classes, zones, and mercenary companions. With its gothic atmosphere, addictive loot chase, and cooperative raids, Diablo IV embodies the series' legacy of slaying evil in a world forever on the brink.",
    "ratings": "4.0",
    "developer": "Blizzard Entertainment",
    "downloads": 2000000,
    "totalReviews": 58994
  },
  {
    "id": "14",
    "title": "Fortnite",
    "coverPhoto": "https://dropinblog.net/34253310/files/featured/imagem-2024-09-26-103919931.png",
    "category": "Battle Royale",
    "downloadLink": "https://www.fortnite.com/download",
    "description": "Fortnite is a free-to-play hybrid of battle royale, building, and live events that evolves constantly with seasons, chapters, and collaborations, dropping 100 players onto a shrinking island to scavenge weapons, build forts, and outlast opponents in squad, duo, or solo modes. Master fluid building mechanics with wood, brick, and metal structures for defensive traps or offensive ramps, while gliding from the Battle Bus and utilizing vehicles like cars, boats, and mechs for mobility. The arsenal spans assault rifles, shotguns, snipers, and mythics like the Infinity Blade, with environmental storytelling through evolving maps featuring POIs like Tilted Towers and Pleasant Park. Beyond battle royale, dive into Save the World co-op PvE for base defense against husks, or Creative mode for custom islands with UEFN tools. Zero Build mode emphasizes natural cover and movement for pure shooting fans. Seasonal battle passes unlock cosmetics, emotes, and wraps through tiered challenges, while crossovers with Marvel, Star Wars, and music artists like Travis Scott deliver immersive concerts and narrative arcs. With its cartoonish art style, accessible yet deep gameplay, and Unreal Engine polish, Fortnite fosters creativity, competition, and community in a metaverse-like ecosystem that redefines multiplayer entertainment.",
    "ratings": "4.5",
    "developer": "Epic Games",
    "downloads": 650000000,
    "totalReviews": 10000000
  },
  {
    "id": "15",
    "title": "League of Legends",
    "coverPhoto": "https://w0.peakpx.com/wallpaper/996/924/HD-wallpaper-league-of-legends-logo-poster-2020-games-lol-artwork-league-of-legends-lol-logo.jpg",
    "category": "MOBA",
    "downloadLink": "https://www.leagueoflegends.com/en-us/download/",
    "description": "League of Legends is a fast-paced multiplayer online battle arena game where two teams of five summoners command champions with unique abilities to destroy the enemy's Nexus in strategic lane-pushing matches lasting 20-50 minutes. Select from over 160 champions across roles like top laner tanks, mid mages, jungle gankers, ADC carries, and support healers, each with passive, three actives, and a game-changing ultimate that synergize in team compositions. The map features three lanes, jungle camps for buffs like red smite and blue mana regen, and objectives such as Dragon for stacking empowers, Baron Nashor for global push buffs, and Rift Herald for tower sieges. Economy management through last-hitting minions buys items that amplify stats, from health potions to mythic legendaries like Infinity Edge for crit damage. Ranked ladder from Iron to Challenger tests mechanical skill, macro decisions, and adaptation to meta shifts via patches balancing win rates. Casual modes include ARAM for all-random all-mid chaos and TFT for auto-battler spin-off. Esports integration with Worlds tournaments, voice comms, and client features like hextech crafting for skins make LoL a cultural phenomenon. With its blend of accessible heroes, deep strategy, and vibrant lore from Runeterra regions, League of Legends captivates millions in epic clashes of skill and teamwork.",
    "ratings": "4.3",
    "developer": "Riot Games",
    "downloads": 180000000,
    "totalReviews": 5000000
  },
  {
    "id": "16",
    "title": "Minecraft",
    "coverPhoto": "https://www.minecraft.net/content/dam/minecraftnet/games/minecraft/key-art/Downloads_Box-Art_Vanilla_600x337%402x.jpg",
    "category": "Sandbox",
    "downloadLink": "https://www.minecraft.net/en-us/download",
    "description": "Minecraft is the ultimate sandbox game where imagination shapes infinite worlds crafted from blocks, allowing players to build, explore, survive, and create in procedurally generated landscapes from lush biomes to treacherous nether realms. Punch trees for wood to craft tools, shelter, and redstone contraptions, mining deep for ores like diamonds while fending off creepers, zombies, and skeletons in survival mode's day-night cycle. Switch to creative for unlimited resources and flight to construct megabases, pixel art, or redstone machines mimicking real computers. Multiplayer servers host minigames like Skyblock, PvP arenas, and roleplay realms, while Realms subscription enables private worlds for up to 10 friends. Mods via Forge or Fabric add dimensions, magic systems, and tech trees, expanding into RPGs or space adventures. Updates introduce features like archaeology for pottery shards, cherry groves for aesthetic builds, and mob votes for community-driven content like the sniffer mob. The Nether and End dimensions offer portals to hellish fortresses and void dragons, with enchanting tables for gear upgrades and brewing stands for potions. Cross-platform play unites Java and Bedrock editions, fostering a creative community with YouTube tutorials, skin customizers, and marketplace maps. With its blocky charm, emergent gameplay, and boundless potential, Minecraft ignites creativity across generations in a pixelated universe without limits.",
    "ratings": "4.9",
    "developer": "Mojang Studios",
    "downloads": 800000000,
    "totalReviews": 5000000
  },
  {
    "id": "17",
    "title": "Grand Theft Auto V",
    "coverPhoto": "https://m.media-amazon.com/images/I/719EWkAGDuL._AC_UF894,1000_QL80_.jpg",
    "category": "Action Adventure",
    "downloadLink": "https://store.steampowered.com/app/3240220/Grand_Theft_Auto_V_Enhanced/",
    "description": "Grand Theft Auto V Enhanced is the definitive open-world crime epic set in the sun-soaked sprawl of Los Santos and Blaine County, switching between three protagonists—Michael the retired bank robber, Franklin the ambitious hustler, and Trevor the volatile psychopath—in a tale of heists, betrayal, and excess. Plan and execute elaborate scores from jewelry store smash-and-grabs to Union Depository vault raids, using specialized abilities like Michael's slow-mo aiming, Franklin's driving precision, and Trevor's rage mode for invincibility. The map brims with activities: skydiving from Mount Chiliad, golfing at Los Santos Country Club, or hunting in the wilderness, all enhanced with ray-tracing, DLSS, and 4K textures for next-gen fidelity. GTA Online evolves with weekly updates, adding heists like The Diamond Casino, businesses such as nightclubs and biker gangs, and vehicles from supercars to flying bikes. Customize apartments, yachts, and crews for persistent criminal empires, competing in races, deathmatches, or adversary modes. Satirical radio stations, TV parodies, and NPC interactions satirize American culture, while the story's moral choices influence relationships and endings. With over 500 hours of content, mod support on PC, and cross-play lobbies, GTA V Enhanced delivers chaotic freedom in a living, breathing world of crime and comedy.",
    "ratings": "4.7",
    "developer": "Rockstar North",
    "downloads": 77000000,
    "totalReviews": 1771533
  },
  {
    "id": "18",
    "title": "Red Dead Redemption 2",
    "coverPhoto": "https://cdn1.epicgames.com/b30b6d1b4dfd4dcc93b5490be5e094e5/offer/RDR2476298253_Epic_Games_Wishlist_RDR2_2560x1440_V01-2560x1440-2a9ebe1f7ee202102555be202d5632ec.jpg",
    "category": "Action Adventure",
    "downloadLink": "https://store.steampowered.com/app/1174180/Red_Dead_Redemption_2/",
    "description": "Red Dead Redemption 2 is a sprawling Western epic chronicling the decline of the Van der Linde gang in 1899 America, where outlaw Arthur Morgan grapples with loyalty, redemption, and the encroaching industrialization through a richly detailed open world from snowy mountains to alligator swamps. Hunt, fish, and craft with a realistic survival system managing honor, weight, and horse bonding for dynamic companion AI. Engage in gunfights with Dead Eye targeting for bullet-time precision, using revolvers, shotguns, and bow for stealth takedowns or explosive dynamite. The narrative branches with choices affecting camp dynamics, stranger missions like helping a moonshiner or chasing a serial killer, and multiple endings tied to Arthur's ledger entries. Explore five states packed with trains to rob, saloons for poker and duels, and bounties for lawmen chases. Red Dead Online offers posse-based co-op for roles like trader, collector, and moonshiner, with daily challenges and frontier series. Enhanced visuals capture golden-hour sunsets, wildlife behaviors, and volumetric fog, powered by RAGE engine. With its immersive simulation of frontier life, profound storytelling, and activities from herb collecting to stagecoach ambushes, RDR2 paints a poignant portrait of a vanishing era in one of gaming's greatest tales.",
    "ratings": "4.8",
    "developer": "Rockstar Games",
    "downloads": 22000000,
    "totalReviews": 744754
  },
  {
    "id": "19",
    "title": "The Witcher 3: Wild Hunt",
    "coverPhoto": "https://cdn1.epicgames.com/offer/14ee004dadc142faaaece5a6270fb628/EGS_TheWitcher3WildHuntCompleteEdition_CDPROJEKTRED_S1_2560x1440-82eb5cf8f725e329d3194920c0c0b64f",
    "category": "RPG",
    "downloadLink": "https://store.steampowered.com/app/292030/The_Witcher_3_Wild_Hunt/",
    "description": "The Witcher 3: Wild Hunt is a masterpiece of narrative RPG where monster hunter Geralt of Rivia searches for his adopted daughter Ciri amid a war-torn Continent, making gut-wrenching choices that ripple through a world of moral ambiguity, political intrigue, and mythical beasts. Traverse vast regions like war-ravaged Velen swamps, opulent Novigrad city, and frozen Skellige isles on foot, horseback, or boat, discovering Gwent card games, fistfighting arenas, and treasure hunts for witcher gear diagrams. Combat demands preparation with oils, potions, and signs like Igni fire blasts or Aard telekinesis, dodging griffin dives and vampire swarms in dynamic, weighty swordplay. The quest log overflows with hundreds of hours of content: main story arcs involving Nilfgaardian invasions, Wild Hunt pursuits, and sorceress romances; side quests like Bloody Baron's family tragedy or eternal fire cult infiltration; and contracts for drowners, basilisks, and leshens rewarding mutant mutations. Expansions Hearts of Stone and Blood and Wine add heist capers and vampire-filled Toussaint vineyard paradise with new levels 100+ and gear sets. New Game+ and photo mode enhance replayability in a lore-deep universe from Andrzej Sapkowski's books. With its unparalleled writing, living world, and REDengine beauty, The Witcher 3 crafts an unforgettable odyssey of humanity in a savage fantasy realm.",
    "ratings": "4.9",
    "developer": "CD Projekt RED",
    "downloads": 28000000,
    "totalReviews": 857579
  },
  {
    "id": "20",
    "title": "Dota 2",
    "coverPhoto": "https://business-portal-bucket.s3.amazonaws.com/media/images/41e172c318357d632f53b92d8cb38661_large_cover.original.jpg",
    "category": "MOBA",
    "downloadLink": "https://store.steampowered.com/app/570/Dota_2/",
    "description": "Dota 2 is the definitive multiplayer online battle arena experience, where two teams of five players command powerful heroes in strategic clashes to destroy the enemy's Ancient. Choose from over 120 unique heroes, each with distinct abilities, attributes, and playstyles ranging from agile carries to durable tanks and versatile supports. Matches unfold on a symmetrical map with three lanes, jungle camps for farming experience and gold, and Roshan pit for the Aegis resurrection item. Economy management through last-hitting creeps and denying enemy units funds item purchases that amplify strengths—build crit-focused for damage, tanky for initiation, or utility for control. Ranked matchmaking spans Herald to Immortal brackets, testing mechanical prowess, macro vision, and team synergy in 30-60 minute epics. Pro scene via The International offers million-dollar prize pools with live spectator modes. Custom lobbies, bot matches, and Turbo mode for quick games cater to all. With constant patches balancing metas, cosmetic treasures, and deep lore, Dota 2 demands mastery and rewards legends in Valve's free-to-play masterpiece.",
    "ratings": "4.1",
    "developer": "Valve",
    "downloads": 200000000,
    "totalReviews": 2140000
  }
]
